# -----------------------------------------------
# Essential Brewfile
# Installed by default via bootstrap.sh
# -----------------------------------------------

# Taps
tap "microsoft/mssql-release"          # Microsoft SQL Server tools
tap "steipete/tap"                      # steipete's homebrew tap
tap "stripe/stripe-cli"                 # Stripe CLI tap
tap "supabase/tap"                      # Supabase CLI tap
tap "yakitrak/yakitrak"                 # Yakitrak tools tap

# --- Dev Tools ---
brew "btop"                             # Resource monitor (better htop)
brew "fastfetch"                        # System info display (like neofetch)
brew "ffmpeg"                           # Video/audio converter & streamer
brew "gh"                               # GitHub CLI
brew "git-sizer"                        # Git repo size analyzer
brew "htop"                             # Interactive process viewer
brew "lazygit"                          # Terminal UI for git
brew "neovim"                           # Modern vim editor
brew "nvm"                              # Node.js version manager
brew "pnpm"                             # Fast Node.js package manager
brew "python@3.13"                      # Python interpreter
brew "ripgrep"                          # Fast recursive search (rg)
brew "rtk"                              # Rust Token Killer (Claude Code proxy)
brew "stow"                             # Symlink farm manager (for dotfiles)
brew "tldr"                             # Simplified man pages
brew "tree"                             # Directory tree visualizer
brew "uv"                               # Fast Python package manager

# --- Cloud / Deploy ---
brew "flyctl"                           # Fly.io CLI
brew "nixpacks"                         # App source → Docker image builder
brew "stripe"                           # Stripe CLI for payments
brew "supabase/tap/supabase"            # Supabase local dev CLI
brew "vercel-cli"                       # Vercel deployment CLI

# --- Database ---
brew "libpq"                            # PostgreSQL client library
brew "unixodbc"                         # ODBC database driver manager

# --- Misc ---
brew "ollama"                           # Local LLM runner
brew "poppler"                          # PDF rendering library
brew "pv"                               # Pipe viewer (progress for pipes)
brew "smartmontools"                    # Disk health monitoring (S.M.A.R.T.)
brew "snitch"                           # Network connection monitor
brew "speedtest-cli"                    # Internet speed test
brew "tailscale"                        # Mesh VPN (CLI)
brew "watchman"                         # File watcher (used by React Native)
brew "wimlib"                           # Windows Imaging format tools
brew "zbar"                             # Barcode/QR code reader library

# --- Essential Apps ---
cask "1password"                        # Password manager
cask "1password-cli"                    # 1Password CLI (op)
cask "claude-code"                      # Claude Code AI assistant
cask "codex"                            # OpenAI Codex CLI
cask "cursor"                           # AI-powered code editor
cask "docker"                           # Docker engine
cask "docker-desktop"                   # Docker GUI & VM manager
cask "figma"                            # UI/UX design tool
cask "firefox"                          # Web browser
cask "ghostty"                          # GPU-accelerated terminal
cask "google-chrome"                    # Web browser
cask "obsidian"                         # Markdown knowledge base
cask "postman"                          # API testing tool
cask "proton-mail"                      # Encrypted email client
cask "proton-mail-bridge"               # Proton Mail IMAP/SMTP bridge
cask "raycast"                          # Spotlight replacement & launcher
cask "signal"                           # Encrypted messenger
cask "surfshark"                        # VPN client
cask "tailscale"                        # Mesh VPN (GUI app)
cask "telegram"                         # Messenger
cask "todoist"                          # Task manager
cask "visual-studio-code"              # Code editor
cask "whatsapp"                         # Messenger
cask "zoom"                             # Video conferencing
